# 1. 기본 출력
print("Hello World")


# 2. 다양한 자료형 출력 ( 숫자 )
print(1)    # 정수 : 소수점이 없는 수
print(1.2)  # 실수 : 소수점이 있는 수
print(1-2j) # 복소수
# ================================
# 진법, 지수 표현도 가능하다
# 2진법 표현은 0b   ,   8진법 표현은 0o     ,  16진법 표현은 0x 를 앞에 붙혀줍니다.
print(0b11)   # 2진법에서 11 은 10진법으로 3 입니다
print(0o11)   # 8진법에서 11 은 10진법으로 9 입니다
print(0x11)   # 16진법에서 11 은 10진법으로 17 입니다
# 하지만 진법표현을 설명하기에는 여러분이 집중해야할 파트가 훠어어얼씬 중요합니다.
# 따라서 그냥 이런게 있다하시고 나중에 필요하시면 학습하시는 게 좋습니다~
print(1e2)  # AeB 라고 할 때 이는 "A 곱하기 10의B 제곱" 입니다.



# 3. 다양한 자료형 출력 ( 문자열 )
# 문자열은 작은따옴표, 큰따옴표로 싸여진 문자 덩어리를 의미합니다~
print('Hello') # 문자열
print("World") # 문자열
# "12", " " , '' 만약 숫자가 싸여있든, 공백이 싸여있든, 심지어 존재하지 않는다해도
# 그냥 싸여있기만하면 문자열이에요!



# 4. print 의 확장 ( 자료 여러개 출력 가능, end 옵션 )
print('hello', 1, 1.3, "World", end="!")  # end 옵션은 defalut(기본)값으로 '\n' 을 가진다.

# 무언가를 출력하기 위해서는 무조건!!!!!!!!!! print 함수를 사용해야합니다.

# 이건 나중에 코딩을 해보면서 이해가 될 사항입니다. 만약 계획한대로 코드가 동작되지 않는다면
# 중간중간에 print 를 해서 정보가 어떻게 흘러가고 있는지 확인할 수 있습니다! 
# 나중에 또 짚어드리겠습니다.











