'''
 이제까지는 프로그램을 해주었던 모든 코드가 동작하는 프로그래밍을 했어요.
 하지만, 이제부터는 프로그램의 흐름을 제어하는 제어문을 배울겁니다!!!
 프로그램의 흐름을 제어한다는 말을 '중국집 식당'에 비유해서 설명해드릴게요.
'''
'''
 중국집 식당은 "손님에게 음식을 제공하는 목적을 가진 체제입니다." 
 이러한 면에서 중국집 식당은 프로그램이라고 할 수 있고요.
 그 안에는 "짜장면을 만드는 프로그램", "짬뽕을 만드는 프로그램" 등 다양한
 작은 프로그램들이 있습니다.
'''
# 제어문 - 조건문
"""
식당의 입장에서는 손님이 무엇을 시킬지 모릅니다!!
만약 짜장면을 시킨다면 식당은 "짜장면을 만드는 프로그램"을 시작할 것입니다.
"짬뽕을 만드는 프로그램"을 실행시키면 안된다는 것이죠!! 

특별상황에서만 실행되는것 혹은 
특별상황에서 실행되면 안되는 것
위와 같이 프로그램을 제어하는 구문을 조건문이라고 해요!! 
"""

# 제어문 - 반복문
"""
 짜장면을 하나 만드는 프로그램              > 하나를 만들때의 레시피
 짜장면을 두개 만드는 프로그램              > 두개를 만들때의 레시피
 짜장면을 세개 만드는 프로그램              > 세개를 만들때의 레시피
 .. 네개... 다섯개 ... 이렇게 레시피를 만드는 식당은 지구상에 존재하지 않습니다.
 왜냐하면 하나의 프로그램을 반복하면 되기 때문입니다.
 프로그래밍에서도 같습니다.
 어떠한 동작이 반복되어야하는 경우 사용하는 것이 반복문이라고 합니다!
"""


