# 이번에는 bool 값을 반환!!!! 하는 연산자를 볼 것입니다.
# 비교연산자가 그 중 하나입니다!!
# 반환!! 즉, 대체된다는 뜻이지요!!!

# 비교연산자
print(10 > 0)    # A > B      A가 크면 True 아니면 False 
print(10 < 0)    # A < B      B가 크면 True 아니면 False 
print(10 == 0)   # A == B     A와 B가 같으면 True 다르면 False
print(10 != 0)   # A != B     A와 B가 다르면 True 같으면 False
print(10 >= 0)   # A >= B     A가 B보다 크거나 같으면 True 아니면 False
print(10 <= 0)   # A <= B     A가 B보다 작거나 같으면 True 아니면 False

# 코드를 실행하면 Bool 값이 출력되는 것을 알 수 있습니다!!!
# 여기서 주의할 것은 '==' 같다는 등호를 두번 사용해주어야한다는 것이에요
# 프로그래밍에서 '=' 등호 하나는 A=B B의 값을 A 에 대입하다 였습니다.
# 두개를 사용해주어야 수학에서 말하는 '같다' 는 뜻이 됩니다.